// Project:  FT60F11x_TIMER0.prj
// Device:   FT60F11X
// Memory:   PROM=1Kx14, SRAM=64Byte, EEPROM=256Byte
// Description: DemoPortOut输出60Hz占空比50%的波形-Timer0实现

// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.1     24-2-21   修改文件头

//*********************************************************
#include "SYSCFG.h"
//***********************宏定义****************************
#define  DemoPortOut	PA4   
/*-------------------------------------------------
* 函数名：interrupt ISR
* 功能：  中断处理
* 输入：  无
* 输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)
{  
	//定时器0的中断处理
	if(T0IE && T0IF)                //8.192ms翻转一次≈60Hz
	{
		T0IF = 0;
		DemoPortOut = ~DemoPortOut; //翻转电平
	} 
} 
/*-------------------------------------------------
* 函数名：POWER_INITIAL
* 功能：  上电系统初始化
* 输入：  无
* 输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{
	 
	OSCCON = 0B01110001;	//IRCF=111=16MHz/2=8MHz,0.125us
	INTCON = 0;  			//暂禁止所有中断
	PORTA = 0B00000000;		
	TRISA = 0B00000000;		//PA输入输出 0-输出 1-输入
							//PA4-OUT
						
	PORTC = 0B00000000; 	
	TRISC = 0B00000000;		//PC输入输出 0-输出 1-输入  
								
	WPUA = 0B01000000;    	//PA端口上拉控制 1-开上拉 0-关上拉
							//开PA6上拉
	OPTION = 0B00000000;	//Bit3=0 TMR0 MODE,PS=000=TMR0 Rate 1:2
                             
    PSRCA = 0B11111111;		//源电流设置最大
    PSRCC = 0B11111111; 
    PSINKA = 0B11111111;    //灌电流设置最大
    PSINKC = 0B11111111;
                      
    MSCON = 0B00110000;		   	
    //Bit5:   PSRCAH4和PSRCA[4]共同决定源电流。00：4mA; 11: 33mA; 01、10:8mA
    //Bit4:   PSRCAH3和PSRCA[3]共同决定源电流。00：4mA; 11: 33mA; 01、10:8mA
    //Bit3:   UCFG1<1:0>为01时此位有意义。0：禁止LVR；1：打开LVR
    //Bit2:   快时钟测量慢周期的平均模式。0：关闭平均模式；1：打开平均模式
    //Bit1:	  0：关闭快时钟测量慢周期；1：打开快时钟测量慢周期
	//Bit0:	  当T2时钟不是选择指令时钟的时候
	//		  0：睡眠时停止工作：1： 睡眠时保持工作。	
}
/*----------------------------------------------------
* 函数名称：TIMER0_INITIAL
* 功能：    初始化设置定时器
* 设置TMR0定时时长=(1/系统时钟频率)*指令周期*预分频值*255
* 				  =(1/16000000)*2*256*255=8.192ms
 ----------------------------------------------------*/
void TIMER0_INITIAL (void)  
{
	OPTION = 0B00000111;
    //Bit5		T0CS Timer0时钟源选择 
	//			1-外部引脚电平变化T0CKI 0-内部时钟(FOSC/2)
	//Bit4		T0CKI引脚触发方式 1-下降沿 0-上升沿
	//Bit3		PSA 预分频器分配位 0-Timer0 1-WDT 
	//Bit[2:0]	PS 8个预分频比 111 - 1:256
	T0IF = 0;				//清空T0软件中断
}
/*-------------------------------------------------
* 函数名:  main 
* 功能：  主函数
* 输入：  无
* 输出：  无
 --------------------------------------------------*/
void main(void)
{
	POWER_INITIAL();		//系统初始化
	TIMER0_INITIAL(); 
	GIE  = 1; 				//开中断
	T0IE = 1;				//开定时器/计数器0中断
	while(1)
	{
		NOP();
	}
}