// Project:  FT60F11x_LVD.prj
// Device:   FT60F11X
// Memory:   PROM=1Kx14, SRAM=64Byte, EEPROM=256Byte
// Description: 设置PA5为LVD检测脚，当PA5为高时，VDD正常，DemoPortOut输出LOW,当PA5为低时，VDD掉到了所设置的低电压以下，DemoPortOut输出HIGH.

// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.1     24-2-21   修改文件头

//*********************************************************
#include "SYSCFG.h"
//***********************宏定义****************************
#define  DemoPortOut	PA4 
/*-------------------------------------------------
* 函数名：POWER_INITIAL
* 功能：  上电系统初始化
* 输入：  无
* 输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{	 
	OSCCON = 0B01110001;	//IRCF=111=16MHz/2=8MHz,0.125us
	INTCON = 0;  			//暂禁止所有中断
    
	PORTA  = 0B00000000;		
	TRISA  = 0B00000000;	//PA输入输出 0-输出 1-输入
							//PA4-OUT
	PORTC  = 0B00000000; 	
	TRISC  = 0B00000000;	//PC输入输出 0-输出 1-输入  
	WPUA   = 0B00000000;    //PA端口上拉控制 1-开上拉 0-关上拉
                            
	OPTION = 0B00001000;	//Bit3=1 WDT MODE,PS=000=1:1 WDT RATE

    PSRCA = 0B11111111;  	//源电流设置最大
    PSRCC = 0B11111111; 
    PSINKA = 0B11111111;    //灌电流设置最大
    PSINKC = 0B11111111;
                      
    MSCON = 0B00110000;		   	
    //Bit5: PSRCAH4和PSRCA[4]共同决定源电流。00：4mA; 11: 33mA; 01、10:8mA
    //Bit4: PSRCAH3和PSRCA[3]共同决定源电流。00：4mA; 11: 33mA; 01、10:8mA
    //Bit3: UCFG1<1:0>为01时此位有意义。0：禁止LVR；1：打开LVR
    //Bit2: 快时钟测量慢周期的平均模式。0：关闭平均模式；1：打开平均模式
    //Bit1: 0：关闭快时钟测量慢周期；1：打开快时钟测量慢周期
    //Bit0: 0：睡眠时停止工作：1： 睡眠时保持工作。
    //		当T2时钟不是选择指令时钟的时候比较器，CxIN为数字IO口
    
 	PCON = 0B11010011;    
    //Bit7		LVD模块检测电压源选择 1：检测外部管脚PA5，0:检测内部电压  
	//Bit[6:4]	低电压侦测选择位。 101 3.0V
    //Bit3		低电压侦测使能。 1:开启LVD侦测功能，0:关闭
    //Bit2		低电压标志位，只读。 1:VDD掉了设置电压以下，0:VDD正常
    //Bit1		上电复位标志，低有效。0:发生了上电复位，1：没有发生
    //Bit0		低电压复位标志，低有效。0:发生了低电压复位，1：没有发生
}
/*-------------------------------------------------
 * 函数名：interrupt ISR
 * 功能：  中断处理函数
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)
{
}
/*-------------------------------------------------
* 函数名：main 
* 功能：  主函数
* 输入：  无
* 输出：  无
 --------------------------------------------------*/
void main(void)
{
	POWER_INITIAL();		   	//系统初始化
    PCON |= 0B00001000;		   	//开启LVD侦测功能
	while(1)
	{	
    	if(PCON&0x04)           //判断低电压标志位
	 	{	   
			DemoPortOut = 1; 	//侦测到低电压标志为1
		}
        else
        {
			DemoPortOut = 0;    //VDD正常
        } 
	}
}