// Project:  FT60F11x_LVD_PWM.prj
// Device:   FT60F11X
// Memory:   PROM=1Kx14, SRAM=64Byte, EEPROM=256Byte
// Description: 低电压检测与PWM联动，检测输出可作为PWM的刹车源。当检测到LVD事件时，PWM刹车，当LVD事件消除时，PWM1~PWM6继续输出10kHz占空比50%的波形。

// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.1     24-2-21   修改文件头

//*************************************************
#include "SYSCFG.h"
/*-------------------------------------------------
* 函数名：interrupt ISR
* 功能：  中断处理
* 输入：  无
* 输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)			
{ 
	//定时器2的中断处
	if(TMR2IE && TMR2IF)			//100us中断一次 
	{
		TMR2IF = 0;
	} 
} 
/*-------------------------------------------------
* 函数名：POWER_INITIAL
* 功能：  上电系统初始化
* 输入：  无
* 输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{
	OSCCON = 0B01110001;		//IRCF=111=16MHz/2=8MHz,0.125us
	INTCON = 0;  				//暂禁止所有中断
    
	PORTA = 0B00000000;		
	TRISA = 0B00000000;			//PA输入输出 0-输出 1-输入
	PORTC = 0B00000000; 	
	TRISC = 0B00000000;			//PC输入输出 0-输出 1-输入  
								
	WPUA = 0B00000000;    		//PA端口上拉控制 1-开上拉 0-关上拉
	OPTION = 0B00001000;		//Bit3=1 WDT MODE,PS=000=1:1 WDT RATE
                             
    PSRCA = 0B11111111;  		//源电流设置最大
    PSRCC = 0B11111111; 
    PSINKA = 0B11111111;    	//灌电流设置最大
    PSINKC = 0B11111111;
 
    MSCON = 0B00110000;			//Bit0: 0:T2睡眠时停止工作	
    //Bit5:	PSRCAH4和PSRCA[4]共同决定源电流。00：4mA; 11: 33mA; 01、10:8mA
    //Bit4:	PSRCAH3和PSRCA[3]共同决定源电流。00：4mA; 11: 33mA; 01、10:8mA
    //Bit3:	UCFG1<1:0>为01时此位有意义。0：禁止LVR；1：打开LVR
    //Bit2:	快时钟测量慢周期的平均模式。0：关闭平均模式；1：打开平均模式
    //Bit1:	0：关闭快时钟测量慢周期；1：打开快时钟测量慢周期
    //Bit0:	0：睡眠时停止工作：1：睡眠时保持工作。 
    //		当T2时钟不是选择指令时钟的时候 
}
/*-------------------------------------------------
* 函数名：	TIMER2_INITIAL
* 功能：	初始化设置定时器2 
* 设置：	周期=(PR+1)*Tt2ck*TMR2预分频(蜂鸣器模式周期*2)
*				=(199+1)*1/8000000*4=100us
*			脉宽=P1xDT*Tt2ck*TMR2预分频
*				=100*1/8000000*4=50us
 -------------------------------------------------*/
void PWM1_INITIAL (void) 
{    
    T2CON0 = 0B00000001; 		  //T2预分频1:4，后分频1:1
    //Bit7:		0：无意义； 1：把PR2/P1xDTy缓冲值分别更新到PR2寄存器和P1xDTy_ACT
    //Bit[6:3]:	定时器2输出后分频比选择 0000:1:1;0001:1:2;……1:16
    //Bit2:		0:关闭定时器2；1：打开定时器2
    //Bit[1:0]:	定时器2预分频选择 00:1;01:4;1x:16
    
	T2CON1 = 0B00000000;		 //T2时钟来自系统时钟,PWM1连续模式
	//Bit4: PWM模式选择 0:连续模式；1：单脉冲模式
    //Bit3: 0:PWM模式；1：蜂鸣器模式	
    //Timer2时钟源选择：000：指令时钟；001：系统时钟；010：HIRC的2倍频；100：HIRC；101：LIRC
    						
    TMR2H = 0;					//定时器2计数寄存器
    TMR2L = 0;
    
	PR2H = 0; 					//周期=（PR+1）*Tt2ck*TMR2预分频(蜂鸣器模式周期*2)
	PR2L = 199;	  
    
    P1ADTH = 0;					//脉宽=P1xDT*Tt2ck*TMR2预分频(蜂鸣器模式没用到)
    P1ADTL = 100;
    
    P1OE = 0B00111111;			//允许P1A0输出PWM（配置成timer定时器时这位清零）
    //Bit7: 	0:禁止P1C输出到管脚;1:充许P1C输出到管脚
    //Bit6: 	0:禁止P1B输出到管脚;1:充许P1B输出到管脚
    //Bit[5:0]: 0:禁止P1Ax输出到管脚;1:充许P1Ax输出到管脚
    
    P1POL = 0B00000000;			//高电平有效
    //Bit7:		0:P1C高电平有效		1:P1C低电平有效
    //Bit6:		0:P1B高电平有效		1:P1B低电平有效
    //Bit[5:0]:	0:P1Ax高电平有效	1:P1Ax低电平有效
    
    P1CON = 0B10000000;
    //Bit7:	PWM 重启使能位
	//		1 = 故障刹车时，P1BEVT位在退出关闭事件时自动清零，PWM自动重启
	//		0 = 故障刹车时，必须用软件将P1BEVT清零以重启PWM
    //Bit[6:0]:PWM死区时间设置
	//		P1DCn = 预定MPWM信号应转变为有效与PWM信号实际转为有效之间的T2CK周期数
    
	PCON = 0B11010011;
	//Bit7		LVD模块检测电压源选择 1：检测外部管脚PA5，0：检测内部电压  
	//Bit[6:4]	低电压侦测选择位。 101 3.0V
	//Bit3		低电压侦测使能。 1：开启LVD侦测功能，0：关闭
	//Bit2		低电压标志位，只读。 1：VDD掉了设置电压以下，0：VDD正常
	//Bit1		上电复位标志，低有效。0：发生了上电复位，1：没有发生
	//Bit0		低电压复位标志，低有效。0：发生了低电压复位，1：没有发生

	P1BR0 = 0B00110000;
	//Bit7 		PWM故障事件状态位 1：发生了故障事件 0：未发生故障事件，PWM输出正常工作
	//Bit[6:4] 	PWM故障源选择位 000=禁止故障刹车功能 001=BK0为低电平 010=BK0为高电平
	//			011=LVDW=1 100=BK0为低电平或LVDW=1 101=BK0位高电平或LVDW=1
	//Bit[3:2]: 故障下，P1B管脚的状态 00=高阻 01=无效电平 1X=有效电平
	//Bit[1:0]: 故障下，P1A管脚的状态 00=高阻 01=无效电平 1X=有效电平

	P1BR1 = 0B00000000;
	//Bit[7:6]	故障下,P1C管脚的状态，只有当P1CALT为1时才有效 00=高阻 01输出0 1X=输出1
	//Bit[5:4]	故障下,P1C管脚的状态，只有当P1CALT为1时才有效 00=高阻 01输出0 1X=输出1
	//Bit3		P1C功能映射选择
	//Bit2		P1B功能映射选择
	//Bit[1:0]	故障下，P1C管脚的状态 00=高阻 01=无效电平 1X=有效电平
    
	TMR2IF = 0;					//清TMER2中断标志
	TMR2ON = 1;					//使能TMER2启动
	PEIE = 1;    				//使能外设中断
	GIE = 1;   					//使能全局中断
}
/*-------------------------------------------------
* 函数名: main 
* 功能：  主函数
* 输入：  无
* 输出：  无
 --------------------------------------------------*/
void main(void)
{
	POWER_INITIAL();			//系统初始化
    PWM1_INITIAL();				//LVD,PWM1,TM2的初始化
    PCON |= 0B00001000;			//开启LVD侦测功能
	while(1)
	{	
    	if(PCON&0x04)       	//判断低电压标志位
	 	{	   
			NOP(); 				//侦测到低电压标志为1
		}
        else
        {
			NOP();
        } 
	}
}