// Project:  FT60F11x_WDT.prj
// Device:   FT60F11X
// Memory:   PROM=1Kx14, SRAM=64Byte, EEPROM=256Byte
// Description:  程序中开启看门狗并将看门狗时间设置为32ms
// 	       		 a. 主函数先在DemoPortOut脚输出一个高3ms低3ms的信号，
// 	       		 b. 然后循环输出高1ms低1ms，500HZ的信号。
// 	       		 如果不在主程序中清看门狗，则每隔32ms单片机复位后，会重复输出a+b信号；
// 	       		 如果在主函数中清看门狗，则一直输出b信号

// RELEASE HISTORY
// VERSION DATE     DESCRIPTION
// 1.1     24-2-21   修改文件头

//*********************************************************
#include "SYSCFG.h"
//***********************宏定义****************************
#define  DemoPortOut	PA4   
/*-------------------------------------------------
 * 函数名：interrupt ISR
 * 功能：  中断处理
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)
{
}
/*-------------------------------------------------
*  函数名：POWER_INITIAL
 * 功能：  上电系统初始化
*  输入：  无
*  输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{	 
	OSCCON = 0B01110001;	//IRCF=111=16MHz/2=8MHz,0.125us
	INTCON = 0;  			//暂禁止所有中断
	PORTA = 0B00000000;		
	TRISA = 0B00000000;		//PA输入输出 0-输出 1-输入
							//PA4-OUT
	PORTC = 0B00000000; 	
	TRISC = 0B00000000;		//PC输入输出 0-输出 1-输入  
	WPUA = 0B00000000;    	//PA端口上拉控制 1-开上拉 0-关上拉
                            
	OPTION = 0B00001000;	//Bit3=1,WDT MODE,PS=000=WDT RATE 1:1
    
    PSRCA = 0B11111111;		//源电流设置最大
    PSRCC = 0B11111111; 
    PSINKA = 0B11111111;    //灌电流设置最大
    PSINKC = 0B11111111;
                      
    MSCON = 0B00110000;		   	
    //Bit5:   PSRCAH4和PSRCA[4]共同决定源电流。00：4mA; 11: 33mA; 01、10:8mA
    //Bit4:   PSRCAH3和PSRCA[3]共同决定源电流。00：4mA; 11: 33mA; 01、10:8mA
    //Bit3:   UCFG1<1:0>为01时此位有意义。0：禁止LVR；1：打开LVR
    //Bit2:   快时钟测量慢周期的平均模式。0：关闭平均模式；1：打开平均模式
    //Bit1:	  0：关闭快时钟测量慢周期；1：打开快时钟测量慢周期
	//Bit0:	  当T2时钟不是选择指令时钟的时候
	//		  0：睡眠时停止工作：1： 睡眠时保持工作。	
}
/*-------------------------------------------------
* 函数名称：DelayUs
* 功能：   短延时函数--16M-2T--大概快1%左右.
* 输入参数：Time 延时时间长度 延时时长Time Us
* 返回参数：无 
 --------------------------------------------------*/	
void DelayUs(unsigned char Time)
{
	unsigned char a;
	for(a=0;a<Time;a++)
	{
		NOP();
	}
}                  
/*-------------------------------------------------
* 函数名称：DelayMs
* 功能：   短延时函数
* 输入参数：Time 延时时间长度 延时时长Time ms
* 返回参数：无 
 --------------------------------------------------*/	
void DelayMs(unsigned char Time)
{
	unsigned char a,b;
	for(a=0;a<Time;a++)
	{
		for(b=0;b<5;b++)
		{
		 	DelayUs(197); 	//快1%
		}
	}
}
/*-------------------------------------------------
* 函数名称：WDT_INITIAL
* 功能：	初始化设置看门狗1S时间复位
* 设置定时时长=(1/32000)*16位预分频值*8位预分频值
			   =(1/32000)*1024*1=32ms
 -------------------------------------------------*/
void WDT_INITIAL (void) 
{
	CLRWDT();  				//清看门狗
	PSA=0;     				//时钟分频分给WDT
	WDTCON = 0B00001011;	//WDTPS:0101-1:1024,PS:000-1:1
}
/*-------------------------------------------------
* 函数名:  main 
* 功能：  主函数
* 输入：  无
* 输出：  无
 --------------------------------------------------*/
void main(void)
{
	POWER_INITIAL();		//系统初始化
	WDT_INITIAL();
	DemoPortOut = 1; 		
	DelayMs(3);     		//3ms
	DemoPortOut = 0;
	DelayMs(3); 			//3ms
	while(1)
	{	
	 	//CLRWDT(); 		 //清看门狗
		DemoPortOut = 1; 	
		DelayMs(1);     	//1ms
		DemoPortOut = 0; 
		DelayMs(1); 		//1ms
	}
}